jmeter.log
2024-09-22 00:28:58,995 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2024-09-22 00:28:59,025 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2024-09-22 00:28:59,025 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2024-09-22 00:28:59,032 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: Version 5.6.3
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: java.version=21.0.4
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: os.name=Mac OS X
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: os.arch=x86_64
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: os.version=12.7.6
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: file.encoding=UTF-8
2024-09-22 00:28:59,033 INFO o.a.j.JMeter: java.awt.headless=true
2024-09-22 00:28:59,034 INFO o.a.j.JMeter: Max memory     =1073741824
2024-09-22 00:28:59,034 INFO o.a.j.JMeter: Available Processors =8
2024-09-22 00:28:59,045 INFO o.a.j.JMeter: Default Locale=English (EN)
2024-09-22 00:28:59,046 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2024-09-22 00:28:59,046 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/5.6.3/libexec
2024-09-22 00:28:59,046 INFO o.a.j.JMeter: user.dir  =/Users/he/Documents/local/netApiJmeter
2024-09-22 00:28:59,046 INFO o.a.j.JMeter: PWD       =/Users/he/Documents/local/netApiJmeter
2024-09-22 00:28:59,048 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: hedeMacBook-Pro.local FullName: localhost
2024-09-22 00:28:59,061 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/he/Documents/local/netApiJmeter/report/dashboard'
2024-09-22 00:28:59,064 INFO o.a.j.s.FileServer: Default base='/Users/he/Documents/local/netApiJmeter'
2024-09-22 00:28:59,066 INFO o.a.j.s.FileServer: Set new base='/Users/he/Documents/local/netApiJmeter'
2024-09-22 00:28:59,295 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2024-09-22 00:28:59,337 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2024-09-22 00:28:59,342 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2024-09-22 00:28:59,346 INFO o.a.j.s.SaveService: Loading file: NeteaseCloudMusicApi.jmx
2024-09-22 00:28:59,418 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-22 00:28:59,418 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-22 00:28:59,418 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-22 00:28:59,418 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-22 00:28:59,418 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2024-09-22 00:28:59,418 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2024-09-22 00:28:59,452 INFO o.a.j.JMeter: Creating summariser <summary>
2024-09-22 00:28:59,457 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2024-09-22 00:28:59,458 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: report/jtl/NeteaseCloudMusicApi.jtl
2024-09-22 00:28:59,458 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/reportgenerator.properties
2024-09-22 00:28:59,458 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2024-09-22 00:28:59,463 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2024-09-22 00:28:59,466 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2024-09-22 00:28:59,467 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2024-09-22 00:28:59,471 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,471 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,471 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,471 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,471 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,472 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,472 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,472 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,473 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,473 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-22 00:28:59,474 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2024-09-22 00:28:59,474 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2024-09-22 00:28:59,474 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2024-09-22 00:28:59,475 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2024-09-22 00:28:59,475 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2024-09-22 00:28:59,475 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2024-09-22 00:28:59,491 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2024-09-22 00:28:59,492 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2024-09-22 00:28:59,492 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2024-09-22 00:28:59,498 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2024-09-22 00:28:59,498 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2024-09-22 00:28:59,574 INFO o.a.j.r.ClassFinder: Will scan jar /usr/local/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-09-22 00:28:59,688 INFO o.a.j.r.ResultCollector: Folder at /Users/he/Documents/local/netApiJmeter/report/jtl was created
2024-09-22 00:28:59,696 INFO o.a.j.JMeter: 正在运行的测试 (1726936139696)
2024-09-22 00:28:59,718 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2024-09-22 00:28:59,718 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2024-09-22 00:28:59,719 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2024-09-22 00:28:59,719 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2024-09-22 00:28:59,723 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2024-09-22 00:28:59,724 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2024-09-22 00:28:59,726 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2024-09-22 00:28:59,746 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = hedeMacBook-Pro.local
2024-09-22 00:28:59,752 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2024-09-22 00:28:59,754 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2024-09-22 00:28:59,754 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2024-09-22 00:28:59,754 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2024-09-22 00:28:59,754 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2024-09-22 00:29:00,345 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.5/s Avg:   518 Min:   518 Max:   518 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2024-09-22 00:29:01,079 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2024-09-22 00:29:01,080 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2024-09-22 00:29:01,084 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2024-09-22 00:29:01,085 INFO o.a.j.r.Summariser: summary +      2 in 00:00:01 =    2.7/s Avg:   365 Min:   290 Max:   441 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2024-09-22 00:29:01,085 INFO o.a.j.r.Summariser: summary =      3 in 00:00:01 =    2.2/s Avg:   416 Min:   290 Max:   518 Err:     0 (0.00%)
2024-09-22 00:29:01,086 INFO o.a.j.JMeter: Generating Dashboard
2024-09-22 00:29:01,086 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2024-09-22 00:29:01,102 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2024-09-22 00:29:01,167 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2024-09-22 00:29:01,167 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2024-09-22 00:29:01,169 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2024-09-22 00:29:01,169 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2024-09-22 00:29:01,177 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2024-09-22 00:29:01,180 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2024-09-22 00:29:01,180 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2024-09-22 00:29:01,180 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2024-09-22 00:29:01,195 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2024-09-22 00:29:01,195 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2024-09-22 00:29:01,196 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2024-09-22 00:29:01,196 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2024-09-22 00:29:01,199 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2024-09-22 00:29:01,199 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 21 samples
2024-09-22 00:29:01,200 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2024-09-22 00:29:01,200 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2024-09-22 00:29:01,200 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2024-09-22 00:29:01,200 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2024-09-22 00:29:01,200 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2024-09-22 00:29:01,200 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2024-09-22 00:29:01,202 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2024-09-22 00:29:01,202 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2024-09-22 00:29:01,202 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2024-09-22 00:29:01,202 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2024-09-22 00:29:01,203 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 45 samples
2024-09-22 00:29:01,203 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 9 samples
2024-09-22 00:29:01,203 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 3 samples
2024-09-22 00:29:01,203 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 3 samples produced in 68ms on channel 0
2024-09-22 00:29:01,204 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2024-09-22 00:29:01,291 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2024-09-22 00:29:01,291 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2024-09-22 00:29:01,292 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2024-09-22 00:29:01,292 INFO o.a.j.r.d.JsonExporter: Checking output folder
2024-09-22 00:29:01,293 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /Users/he/Documents/local/netApiJmeter/report/dashboard/statistics.json
2024-09-22 00:29:01,339 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2024-09-22 00:29:01,342 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/he/Documents/local/netApiJmeter/report/dashboard
2024-09-22 00:29:01,480 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/he/Documents/local/netApiJmeter/report/dashboard, creating folder structure
2024-09-22 00:29:01,482 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/usr/local/Cellar/jmeter/5.6.3/libexec/bin/report-template' to '/Users/he/Documents/local/netApiJmeter/report/dashboard', got message: /Users/he/Documents/local/netApiJmeter/report/dashboard, found non empty folder with following content [/Users/he/Documents/local/netApiJmeter/report/dashboard/statistics.json], will be ignored
2024-09-22 00:29:01,893 INFO o.a.j.JMeter: Dashboard generated