jmeter.log
2024-09-15 23:52:36,238 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2024-09-15 23:52:36,273 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2024-09-15 23:52:36,274 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2024-09-15 23:52:36,281 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2024-09-15 23:52:36,281 INFO o.a.j.JMeter: Version 5.6.3
2024-09-15 23:52:36,281 INFO o.a.j.JMeter: java.version=21.0.4
2024-09-15 23:52:36,281 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2024-09-15 23:52:36,281 INFO o.a.j.JMeter: os.name=Mac OS X
2024-09-15 23:52:36,282 INFO o.a.j.JMeter: os.arch=x86_64
2024-09-15 23:52:36,282 INFO o.a.j.JMeter: os.version=12.7.6
2024-09-15 23:52:36,282 INFO o.a.j.JMeter: file.encoding=UTF-8
2024-09-15 23:52:36,282 INFO o.a.j.JMeter: java.awt.headless=true
2024-09-15 23:52:36,282 INFO o.a.j.JMeter: Max memory     =1073741824
2024-09-15 23:52:36,282 INFO o.a.j.JMeter: Available Processors =8
2024-09-15 23:52:36,294 INFO o.a.j.JMeter: Default Locale=English (EN)
2024-09-15 23:52:36,294 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2024-09-15 23:52:36,295 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/5.6.3/libexec
2024-09-15 23:52:36,295 INFO o.a.j.JMeter: user.dir  =/Users/he/Documents/local/netApiJmeter
2024-09-15 23:52:36,295 INFO o.a.j.JMeter: PWD       =/Users/he/Documents/local/netApiJmeter
2024-09-15 23:52:36,297 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: hedeMacBook-Pro.local FullName: localhost
2024-09-15 23:52:36,312 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/he/Documents/local/netApiJmeter/report/dashboard'
2024-09-15 23:52:36,315 INFO o.a.j.s.FileServer: Default base='/Users/he/Documents/local/netApiJmeter'
2024-09-15 23:52:36,317 INFO o.a.j.s.FileServer: Set new base='/Users/he/Documents/local/netApiJmeter'
2024-09-15 23:52:36,554 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2024-09-15 23:52:36,594 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2024-09-15 23:52:36,598 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2024-09-15 23:52:36,601 INFO o.a.j.s.SaveService: Loading file: demo1.jmx
2024-09-15 23:52:36,671 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-15 23:52:36,671 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-15 23:52:36,671 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-15 23:52:36,671 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2024-09-15 23:52:36,672 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2024-09-15 23:52:36,672 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2024-09-15 23:52:36,709 INFO o.a.j.JMeter: Creating summariser <summary>
2024-09-15 23:52:36,714 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2024-09-15 23:52:36,715 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: demo1.jtl
2024-09-15 23:52:36,715 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/reportgenerator.properties
2024-09-15 23:52:36,716 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2024-09-15 23:52:36,720 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2024-09-15 23:52:36,723 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2024-09-15 23:52:36,724 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2024-09-15 23:52:36,724 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2024-09-15 23:52:36,724 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2024-09-15 23:52:36,724 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2024-09-15 23:52:36,724 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2024-09-15 23:52:36,724 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2024-09-15 23:52:36,725 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2024-09-15 23:52:36,729 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,730 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,730 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,730 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,730 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,731 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,731 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,731 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,731 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,732 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2024-09-15 23:52:36,733 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2024-09-15 23:52:36,733 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2024-09-15 23:52:36,733 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2024-09-15 23:52:36,734 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2024-09-15 23:52:36,734 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2024-09-15 23:52:36,734 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2024-09-15 23:52:36,751 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2024-09-15 23:52:36,752 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2024-09-15 23:52:36,752 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2024-09-15 23:52:36,759 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2024-09-15 23:52:36,759 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2024-09-15 23:52:36,834 INFO o.a.j.r.ClassFinder: Will scan jar /usr/local/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2024-09-15 23:52:36,955 INFO o.a.j.JMeter: 正在运行的测试 (1726415556955)
2024-09-15 23:52:36,979 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2024-09-15 23:52:36,979 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2024-09-15 23:52:36,979 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2024-09-15 23:52:36,979 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2024-09-15 23:52:36,984 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2024-09-15 23:52:36,984 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2024-09-15 23:52:36,987 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2024-09-15 23:52:37,007 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = hedeMacBook-Pro.local
2024-09-15 23:52:37,014 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2024-09-15 23:52:37,015 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2024-09-15 23:52:37,016 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2024-09-15 23:52:37,016 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2024-09-15 23:52:37,016 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2024-09-15 23:52:38,546 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2024-09-15 23:52:38,546 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2024-09-15 23:52:38,550 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2024-09-15 23:52:38,552 INFO o.a.j.r.Summariser: summary =      3 in 00:00:02 =    1.9/s Avg:   483 Min:   361 Max:   670 Err:     0 (0.00%)
2024-09-15 23:52:38,552 INFO o.a.j.JMeter: Generating Dashboard
2024-09-15 23:52:38,553 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2024-09-15 23:52:38,565 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2024-09-15 23:52:38,632 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2024-09-15 23:52:38,632 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2024-09-15 23:52:38,635 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2024-09-15 23:52:38,635 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2024-09-15 23:52:38,644 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2024-09-15 23:52:38,646 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2024-09-15 23:52:38,646 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2024-09-15 23:52:38,646 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2024-09-15 23:52:38,659 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2024-09-15 23:52:38,659 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2024-09-15 23:52:38,660 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2024-09-15 23:52:38,660 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2024-09-15 23:52:38,663 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2024-09-15 23:52:38,663 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 21 samples
2024-09-15 23:52:38,663 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2024-09-15 23:52:38,664 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2024-09-15 23:52:38,664 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2024-09-15 23:52:38,664 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2024-09-15 23:52:38,664 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2024-09-15 23:52:38,664 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 45 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 9 samples
2024-09-15 23:52:38,666 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 3 samples
2024-09-15 23:52:38,667 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 3 samples produced in 69ms on channel 0
2024-09-15 23:52:38,667 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2024-09-15 23:52:38,752 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2024-09-15 23:52:38,752 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2024-09-15 23:52:38,752 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2024-09-15 23:52:38,753 INFO o.a.j.r.d.JsonExporter: Checking output folder
2024-09-15 23:52:38,753 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /Users/he/Documents/local/netApiJmeter/report/dashboard/statistics.json
2024-09-15 23:52:38,799 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2024-09-15 23:52:38,801 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/he/Documents/local/netApiJmeter/report/dashboard
2024-09-15 23:52:38,934 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/he/Documents/local/netApiJmeter/report/dashboard, creating folder structure
2024-09-15 23:52:38,936 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/usr/local/Cellar/jmeter/5.6.3/libexec/bin/report-template' to '/Users/he/Documents/local/netApiJmeter/report/dashboard', got message: /Users/he/Documents/local/netApiJmeter/report/dashboard, found non empty folder with following content [/Users/he/Documents/local/netApiJmeter/report/dashboard/statistics.json], will be ignored
2024-09-15 23:52:39,288 INFO o.a.j.JMeter: Dashboard generated